[General Setting]
Language_Name=Magyarország--Magyar
Image_index=4
[ALL]
////////////////////////////////main/////////////////////////
IDC_STC_TITLE = Felvevő
IDC_STC_SIZE = Méret:
IDC_STC_TIME = Idő:
IDC_STC_STATUS = Állapot:

IDR_MENU_TRAY_SHOWMAIN = A fő(ablak) megjelenítése
IDR_MENU_TRAY_START = Felvétel
IDR_MENU_TRAY_PAUSE = Szünet
IDR_MENU_TRAY_STOP = Leállítás
IDR_MENU_TRAY_EXIT = kilépés


IDC_STATIC_TIP_RECORDDEST = Cél:
IDC_STATIC_TIP_AUDIO = Hang:
IDC_STATIC_TIP_OUTPUT = Célmappa:
IDC_STATIC_RECORDDEST_NONE = Semmi(None)
IDC_BUTTON_RECORD = Felvétel
IDC_BUTTON_PAUSE = Szünet
IDC_BUTTON_STOP = Leállítás
IDC_BUTTON_CONTINUE = Folytatás

IDC_STATIC_MAIN_BUY = Vásárlás
IDC_STATIC_MAIN_REG = Regisztrálás
IDC_STATIC_MAIN_ABOUT = Útmutató

strCameraFormat = Camera@%s
////////////////////////////////播放器/////////////////////////
IDC_STC_PLAYER_TITLE = Mádialejátszók
IDR_MENU_PLAYER_OPENFILE = Fájl megnyitása
IDR_MENU_PLAYER_PLAY = Lejátszás
IDR_MENU_PLAYER_PAUSE =Szünet
IDR_MENU_PLAYER_STOP = Leállítás

////////////////////////////////设置/////////////////////////
IDC_STC_ADVANCEDSET_TITLE = Beállítások
IDC_BUTTON_SETTARGET = Cél
IDC_BUTTON_SETVIDEO = Video
IDC_BUTTON_SETAUDIO = Hang
IDC_BUTTON_SETWATERMARK = Vízjel
IDC_BUTTON_SETCURSOR = Kurzor
ID_BUTTON_SETSCREENSHOT = Képernyőfelv
ID_BUTTON_SETHOTKEY = Gyorsbill
ID_BUTTON_OK = Rendben
ID_BUTTON_CANCEL = Mégse

////////////////////////////////设置--视频/////////////////////////
IDC_STC_VIDEO_FOLDER = Mappa:
IDC_STC_VIDEO_RECORDREGION = Tartomány:
IDC_STC_VIDEO_QUALITY = Minőség:
IDC_STC_VIDEO_FORMAT = Formátum:
IDC_STC_VIDEO_FRAME = FPS:
IDC_STC_VIDEO_RESOLUTION = Felbontás:
IDC_STC_VIDEO_RECORDOBJECT = Objektum:
IDC_STATIC_VIDEO_CAMERA = Kamera:
IDC_CHECK_RECORDSCREEN = Képernyő
IDC_CHECK_RECORDCAMERA = Képernyőfelvétel és webkamera egyidőben
IDC_RADIO_FULLSCREEN = Teljesképernyő
IDC_RADIO_USERDEFINED = Megadható
IDC_RADIO_CAMERA = Kamera
IDC_COMBO_VIDEO_QUALITY_0 = A legnagyobb
IDC_COMBO_VIDEO_QUALITY_1 = Nagyobb
IDC_COMBO_VIDEO_QUALITY_2 = Átlagos
IDC_COMBO_VIDEO_QUALITY_3 = Kisebb
IDC_COMBO_VIDEO_QUALITY_4 = A legkisebb
IDC_BTN_PREVIEW_OPEN = Előnézet
IDC_BTN_PREVIEW_CLOSE = Bezárás
IDC_CHECK_VIDEO_HW = A GPU-gyorsítás engedélyezése
IDC_BUTTON_AUTORECORD = Auto Record

IDC_COMBO_VIDEO_RESOLUTION_0 = Eredeti méret
IDC_COMBO_VIDEO_RESOLUTION_1 = Az eredeti méret 50%-a
IDC_COMBO_VIDEO_RESOLUTION_2 = 320 x 240
IDC_COMBO_VIDEO_RESOLUTION_3 = 480 x 360
IDC_COMBO_VIDEO_RESOLUTION_4 = 640 x 480
IDC_COMBO_VIDEO_RESOLUTION_5 = 800 x 600
IDC_COMBO_VIDEO_RESOLUTION_6 = 1280 x 720
IDC_COMBO_VIDEO_RESOLUTION_USER = A felhasználó által megadott

IDC_CHECK_TARGET_HIDECAMERA = A kameraablak elrejtése felvételkor
IDC_CHECK_TARGET_HOTSHOT = Gyorsfelvétel(hotshot)
IDC_STATIC_TARGET_SCALE = Méretarány:
IDC_STATIC_TARGET_SCALE_FORMAT = %0.1f 
IDC_STATIC_TARGET_HOTKEY_TIP = Gyorsbillentyű megnyitása/bezárása：

IDC_STATIC_USERDEFINEDPARAM_TITLE = A felhasználó által megadott
IDC_STATIC_USERDEFINEDPARAM_DES1 = Új felbontás:
IDC_STATIC_USERDEFINEDPARAM_DES2 = Új FPS:
IDC_STATIC_USERDEFINEDPARAM_TIP1 = A video-szélesség nem lehet üres!
IDC_STATIC_USERDEFINEDPARAM_TIP2 = A video-magasság nem lehet üres!
IDC_STATIC_USERDEFINEDPARAM_TIP3 = A video-szélességnek nullánál nagyobbnak kell lennie!
IDC_STATIC_USERDEFINEDPARAM_TIP4 = A video-magasságnak nullánál nagyobbnak kell lennie!
IDC_STATIC_USERDEFINEDPARAM_TIP5 = A vide-képméretarány nem lehet üres!
IDC_STATIC_USERDEFINEDPARAM_TIP6 = A video-képméretaránynak nullánál nagyobbnak kell lennie!
IDC_STATIC_USERDEFINEDPARAM_TIP7 = A video-képméretarány nem lehet nagyobb 40-nél!

IDC_CHECK_TARGET_TRANS = Átlátszó/rétegzett ablakok felvétele
IDC_STATIC_TARGET_TRANS = Ha bejelöli ezt a lehetőséget, a képernyőn látható átlátszó/rétegzett ablakok is felvételre kerülnek. Mivel ez a lehetőség lassítja a felvételt, csak indokolt esetben használja!

////////////////////////////////设置--音频/////////////////////////
IDC_STC_AUDIO_DEVICE = Forrás:
IDC_STC_AUDIO_QUALITY = Minőség:
IDC_COMBO_AUDIO_QUALITY_0 = Magas
IDC_COMBO_AUDIO_QUALITY_1 = Átlagos
IDC_COMBO_AUDIO_QUALITY_2 = Alacsony

////////////////////////////////设置--水印/////////////////////////
IDC_BUTTON_WATERMARK_TAB_TEXT = Szöveges vízjel
IDC_BUTTON_WATERMARK_TAB_IMAGE = Képi vízjel
IDC_STATIC_TEXTWATERMARK_TRANSPARENT = Átlátszóság:
IDC_STATIC_TEXTWATERMARK_ROTATE = Forgatás:
IDC_STATIC_TEXTWATERMARK_ALIGNMENT = Igazítás:
IDC_STATIC_TEXTWATERMARK_ALIGNMENT_X = X：
IDC_STATIC_TEXTWATERMARK_ALIGNMENT_Y = Y：
IDC_CHECK_TEXTWATERMARK_SCROLL = Görgetés engedélyezése
IDC_STATIC_TEXTWATERMARK_DIRECT = Közvetlen görgetés
IDC_STATIC_TEXTWATERMARK_SIZE = Görgetési méret
IDC_STATIC_TEXTWATERMARK_TIME = A görgetés hossza
IDC_CHECK_TEXTWATERMARK_FADEIN = Beúsztatás
IDC_CHECK_TEXTWATERMARK_FADEOUT = Kiúsztatás
IDC_CHECK_TEXTWATERMARK_REPEAT = Ismétlés
IDC_BUTTON_ADD_TEXTWATERMARK = Hozzáadás
IDC_BUTTON_TEXTWATERMARK_FONT = Betű
IDC_BUTTON_TEXTWATERMARK_PREVIEW = Előnézet

IDC_STATIC_IMAGEWATERMARK_SCALE = Méretarány:
IDC_STATIC_IMAGEWATERMARK_SCALE_WIDTH = Szélesség:
IDC_STATIC_IMAGEWATERMARK_SCALE_HEIGHT = Magasság:
IDC_STATIC_IMAGEWATERMARK_ROTATE = Forgatás:
IDC_STATIC_IMAGEWATERMARK_FILEPATH = Fájl：
IDC_STATIC_WATERMARKPREVIEW_TITLE = Előnézet

IDC_BUTTON_WATERMARK_CLEAR = Törlés
IDC_CHECK_TEXTWATERMARK = A vízjel engedélyezése
IDC_COMBO_TEXTWATERMARK_DIRECT_0 = Vízszintes
IDC_COMBO_TEXTWATERMARK_DIRECT_1 = Függőleges

IDC_STATIC_WATERMARK_DES1 = Nincs vízjel
IDC_STATIC_WATERMARK_DES2 = Adjon hozzá vízjelet

IDC_STATIC_IMAGEWATERMARK_IMAGE = Kép:

////////////////////////////////设置--水印-Font/////////////////////////
IDC_STATIC_FONT_TITLE = Betű
IDC_STATIC_FONT_NAME = Név：
IDC_STATIC_FONT_SIZE = Méret：
IDC_STATIC_FONT_COLOR = Szín：
IDC_STATIC_FONT_DISTANCE = Térköz:
IDC_CHECK_FONT_SHADOW = Árnyék engedélyezése
IDC_CHECK_FONT_STROKE = Simítás(Stroke) engedélyezése
IDC_CHECK_FONT_GLOWOUT = Csillogás(Glowout) engedélyezése
IDC_BUTTON_FONT_OK = Rendben
IDC_BUTTON_FONT_CANCEL = Mégse


////////////////////////////////设置--鼠标/////////////////////////
IDC_CHECK_CURSOR_RECORD = Az egérkurzor beágyazása a felvételbe.
IDC_CHECK_CURSOR_SCREENSHOT = Az egérkurzor beágyazása a képernyőfelvételbe.
IDC_CHECK_CURSOR_SOUND = Egérkattintási hanghatás.
IDC_CHECK_CURSOR_CLICKEFFECT = Egérkattintási hatás:
IDC_STATIC_CURSOR_LEFTTIP = Bal-kattintás:
IDC_STATIC_CURSOR_RIGHTTIP = Bal duplakattintás:

////////////////////////////////设置--截图/////////////////////////
IDC_STATIC_SCREENSHOT_FORMAT = Fájlformátum:
IDC_STATIC_SCREENSHOT_OUTPUT = Célmappa:
IDC_CHECK_SCREENSHOT_CLICK = Képernyőfelvétel készítése egérkattintáskor
IDC_CHECK_SCREENSHOT_TIME = minden
IDC_STATIC_SCREENSHOT_TIME = másodpercben
IDC_CHECK_SCREENSHOT_SOUND = Redőnyhang

////////////////////////////////设置--快捷键/////////////////////////
//suker
IDC_BUTTON_AUDIO_ADVANCED = Haladó(Advanced)

////////////////////////////////摄像头预览/////////////////////////
IDC_STATIC_CAMERAPREVIEW_TITLE = Előnézet - %s
IDS_OPEN_CAMERA_FAILED = Nem sikerült megnyitni a kamerát!

////////////////////////////////设置--常规/////////////////////////
IDC_CHECK_DEFAULTRECORDSIZE = 录制范围默认尺寸
IDC_CHECK_MINWINDOW = 录制时最小化窗口
IDC_CHECK_OPENFILE = 录制完成后直接打开文件
IDC_STC_COMMON_CLOSEAPP = 关闭程序时：
IDC_RADIO_CLOSETO_TRAY = 最小化到托盘
IDC_RADIO_CLOSETO_EXIT = 退出程序
IDC_COMBO_DEFAULTRECORDSIZE_0 = 400x300
IDC_COMBO_DEFAULTRECORDSIZE_1 = 640x480
IDC_COMBO_DEFAULTRECORDSIZE_2 = 720x480
IDC_COMBO_DEFAULTRECORDSIZE_3 = 800x600
IDC_COMBO_DEFAULTRECORDSIZE_4 = Teljesképernyő

////////////////////////////////设置--高级/////////////////////////
IDC_STC_ADVANCED_HOTKEY = Gyorsbillentyű:
IDC_STC_ADVANCED_RECORD = Indítás:
IDC_STC_ADVANCED_PAUSE  = Szünet:
IDC_STC_ADVANCED_STOP   = Leállítás:
IDC_STC_ADVANCED_SCREENSHOT   = Képernyőfelv:
IDC_STC_ADVANCED_NOTE   = 添加注释：
IDC_CHECK_NOTE_TIME     = 时间/日期注释
IDC_CHECK_NOTE_WATERMARK= 添加水印
IDC_CHECK_NOTE_TITLE    = 标题注释

////////////////////////////////录制范围设置界面/////////////////////////
IDC_STC_AREAHELPER_TITLE = Tartomány
IDC_STATIC_WIDTH = Szélesség:
IDC_STATIC_HEIGHT = Magasság:
IDC_BUTTON_HELPER_RECORD = Felvétel

////////////////////////////////图片列表/////////////////////////
IDC_BUTTON_BROWSERIMAGE_LOAD = Vízjel betöltése
IDC_BUTTON_BROWSERIMAGE_DELETE = Törlés
IDC_BUTTON_BROWSERIMAGE_OK = Rendben
IDC_BUTTON_BROWSERIMAGE_CANCEL = Mégse
IDC_BUTTON_BROWSERIMAGE_TITLE = Tallózás
IDC_BUTTON_BROWSERIMAGE_DES = Saját vízjel hozzáadásához vagy meglevő kijelöléséhez kattintson a "Vízjel betöltése" gombra.


////////////////////////////////提示信息/////////////////////////
IDS_PLAYER_FILTER = Videofájl|*.avi;*.mp4;*.wmv;*.mpg;*.swf|Minden fájl (*.*)|*.*||
IDS_RECORD_FAILED = Nem sikerült elindítani a felvételt! Hibakód:%d
IDS_CREATEDIR_FAILED = Nem lehet létrehozni a(z) %s mappát. Próbálja meg újra!
IDS_FOLDER_ERRORNAME = Nem jó mappanevet adott meg. A mappa neve nem tartalmazhatja a következő karaktereket: * <> "/ |?
IDS_FOLDER_TIP1 = A(z) %s mappa nem létezik. 
IDS_FOLDER_TIP2 = Létrehozza?
IDS_SELECT_FOLDER = Adja meg a célmappát
IDS_IMAGEWATERMARK_FILTER = Az összes kép(*.jpg;*.png;*.png;*.gif)|*.jpg;*.png;*.bmp;*.gif|


IDS_RECORD_START = A felvétel indítása ...

//suker
IDS_RECORD_RECORDING = Felvétel ...
IDS_RECORD_PAUSE = Felfüggesztve
IDS_RECORD_READY = Kész

IDS_AUDIO_DEVICE_MIX_MIC =  Számítógéphang és mikrofon
IDS_AUDIO_DEVICE_MIX = Számítógéphang
IDS_AUDIO_DEVICE_MIC = Mikrofon
IDS_AUDIO_DEVICE_NONE = Semmi

IDS_CLOSEAPP_WHEN_RECORD = Folyik a felvétel! Leállítja?
IDS_HOTKEY_REDEFINE = A(z) [%s]-kulcs már használatban van! Adjon meg másikat.
IDS_VOLUME = Hangerő(Volume)
IDS_NO_CAMERADEVICE = A szoftver nem érzékel kamerát. Telepítsen egyet!
IDS_INIT_CAMERA_FAILED = Nem sikerült beüzemelni a kamerát!
IDS_PLAYER_TITLE = %s videolejátszó

[ImageListTabName]
Protection = Védelem
Business = Üzlet
Love = Szerelem
Festival = Ünnepség
Icon = Ikon
Feature = Tulajdonság
Digital = Digitális
Cute = Csinos(Cute)
Life = Élet
User = Felhasználó



[Tips]
m_btnOutput = A célmappa megnyitása
m_btnSetOutput = A célmappa megadása
m_btnStartRecord = A felvétel indítása
m_btnSetRegionType = A tartomány megadása
m_btnPlay = Lejátszás
m_btnPause = Szünet
m_btnStop = Leállítás
m_btnSettings = Beállítások
m_btnChangeLang = A nyelv megváltoztatása
m_btnAudio = Hangeszköz
m_btnCamera_Open = Kattintson a kamera megnyitásához
m_btnCamera_Close = Kattintson a kamera bezárásához
m_btnClose = Bezárás
strHasTmpWatermark = Nem mentette a vízjelet! Hozzáadja?
strInvalidImage = A képfájl érvénytelen!
strTrial =
strFamilyLicense = Családi licensz
strWatermark1 = 
strWatermark2 = www.thundershare.net
strWatermark3 = 
strConfigPath = \ThunderSoft\Free Screen Recorder\
strClearTip = Valóban törli az összes vízjelet?

[ErrorCode]
0001 = Nincs telepített kódoló. A felvétel nem sikerült!
0002 = Nem sikerült a felvétel, mert a kódoló nem megfelelő!
0003 = Nem sikerült a felvétel, mert a a kódoló nem megfelelő!
0004 =  Paraméterhiba miatt nem sikerült a felvétel!
0005 = Belső hiba miatt nen sikerült a felvétel!

[frmReg]
lblTitle = Szoftver-regisztrálás
lblDescription1 =  A ThunderSoft Screen Recorder kipróbálási verziójában képernyőfelvételkor a "nem-regisztrált" vízjel látható. Regisztrálókód vásárlásával megszünnek a korlátozások.
lblDescription2 =   Megvásárlás után a tőlünk kapott email-ben megtalálja a regisztrálónevet és kódot.
lblDescription3 =Egyszeri fizetés, életre szóló INGYENES frissítés!
lblDescription3_1 = Kattintson a(z) 
lblDescription3_2 = gombra a korlátozások feloldásához.
btnBuy = Megvásárlás!
btnReg = Regisztrálás
btnEvaluate = Kiértékelés

lblUserName = Kapcsolatfelvétel (Email):
lblkey = Regisztrálókód:
lblProblem = Lépjen kapcsolatba velünk:

strNoKey =  Adja meg a regisztrálókódot!
strNoName = Adja meg az email-címét!
strErrorEmail = Az email formáuma nem megfelelő. Adja meg ismét!
strRegSuccess =Sikerült frissíteni a regisztrált verzióra.
strRegToName = Ezt a szoftvert regisztrálta: %s
strRegFailed = Nem sikerült frissíteni a teljesverzióra.
strErrorKeyLength = Nem megfelelő a regkód hossza.
strRegFailedReason1 = A termékkód nem megfelelő.
strRegFailedReason2 = Nem sikerült a regisztrálás.
strRegFailedReason3 = Nem sikerült a termék regisztrálása.
strRegFailedReason4 = A terméket nem sikerült aktiválni, mert nem lehet a hálózaton ellenőrizni a regisztrálókódot!
strInvalidKey = Nem lehet a hálózaton ellenőrizni a regisztrálókódot. Vásároljon érvényes kulcsot!
strKeyBeDeleted = Észleltük, hogy törölték a regisztrációs adatokat. Lépjen kapcsolatba velünk és regisztrálja újra a szoftvert!
support=Kapcsolatfelvétel a technikai támogatás csoporttal

[frmRegTip]
lblTitle=Regisztrálási tipp
lblDes1_1=Nem sikerült a regisztrálás, mert a megadott kódot már használják egy PC-n.
lblDes1_2=Nem sikerült a regisztrálás, mert a beírt regisztrálókód csak  3 PC-n használható.
lblDes2=A probléma kétféleképpen oldható meg:
lblBuy=1.  Vásároljon másik regisztrálókódot a PC érvényesítéséhez.
lblActive=2. Érvényesítse újra a regisztrálókódot másik PC-n, majd érvényesítse a PC-t.
lblEmail=Regisztrálókód:
btnBuy=Megvásárlás most!
btnActive=Folytatás
btnOK=Bezárás
strActiveFailed=Nem sikerült érvényesíteni a PC-t. Adja meg a helyes regisztrálókódot!
lblTip1=
lblTip2=

[frmGetNewVersion]
Title = Elkészült az új verzió.
btnUpdate = Frissítés most
btnCancel = Emlékeztessen később
HasNewVerson = Elkészült az új, (%s) verzió!
VersionTip = Örömmel jelentjük, hogy elkészült a %s új verziója, amely több tulajdonsággal bővült. A legújabb verzió használatával nagyobb élményben lesz része. Letöltéséhez kattintson a 'Frissítés most' gombra.
FreeVersionTip = Örömmel jelentjük, hogy elkészült a %s új verziója, amely több tulajdonsággal bővült. A legújabb verzió használatával nagyobb élményben lesz része. Letöltéséhez kattintson a 'Frissítés most' gombra.

[frmAbout]
Type = 1
About = Névjegy
version= Verzió:
VersionNumber = 6.3.0
copyright=Copyright (C) 2016 ThunderSoft. All Rights Reserved.
homePage= Látogatás a termék honlapjára
lblRegTo=Regisztrálta:
support= Kapcsolat a technikai támogatás csoporttal
btnOK = Rendben
lblDes = Figyelmeztetés: Ezt a számítógépes programot törvényes szerzői jogok és nemzetközi szerződések védik. Jogosulatlan sokszorosítása vagy terjesztése szigorú polgári és büntetőjogi felelősségrevonással, illetve a legnagyobb mértékű büntetéssel járhat.



[Product]
Company Name = ThunderSoft
CompanyHomePage = http://www.thundershare.net/free-screen-recorder/
Product short Name = Free Screen Recorder
Product long Name = Free Screen Recorder
ProductHomePage = http://www.thundershare.net/free-screen-recorder/
ProductHelpPage = http://www.thundershare.net/free-screen-recorder/
PurchaseURL = http://www.thundershare.net/screen-recorder/buy.html
BuyNowURL = http://www.thundershare.net/screen-recorder/buy.html
Support Email = thundersoftsupport@gmail.com